Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.vm-1 will be created
+ resource "yandex_compute_instance" "vm-1" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC4yhL7UgUxDrLmATxTfZuU6S93fOBYxdA1cq7RkvXtt3brdDvwxEObp/uJTit3yfGjqZm8EwfIDxD9ZZrqpXVk/EM4Q0EWMAul58NFULMGxS7KKDIpZp3JgX7hq80iSel3GKIV+mJtX92T2GreRCTngRUuBp9RNxiQaNHmmyqE2OqYT3zZ43vdsvO80vfLlyiHrJ/p1lfY7EAVOI+pmnzNHRKkIwCuh2Qhc0vazTVly9Dlw2O4SAE1celZ0tfz4Kt81NIXaWplExdGa2f2c1cKNTtyhoy5qFXiS5s9J4CjGa6lEzRT3ZDH6IFoBrEOsHTUjFOpHYD8G2pcXqPkCfZw3obmXyMT+CYC58JC9o+nms2oRwJlIqdqwEyqj6O2ErMvj/VJWhdPFHMafmAs8I7y7SJd1TMVMUiyVM0VFpuGW98ZCr4jIW1Mq+Y+JYTQY4Ygf6kz/DC1v00NeumHCUJTqrnEL4Ag9h98qED1UlnHhSjzTHflQFQi9o/DPZ4vMhU= anatol@WIN-QLVHA9MV1CM
            EOT
        }
      + name                      = "terraform1"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd807ed79a4kkqfvd1mb"
              + name        = (known after apply)
              + size        = (known after apply)
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + placement_group_id = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.vm-2 will be created
+ resource "yandex_compute_instance" "vm-2" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC4yhL7UgUxDrLmATxTfZuU6S93fOBYxdA1cq7RkvXtt3brdDvwxEObp/uJTit3yfGjqZm8EwfIDxD9ZZrqpXVk/EM4Q0EWMAul58NFULMGxS7KKDIpZp3JgX7hq80iSel3GKIV+mJtX92T2GreRCTngRUuBp9RNxiQaNHmmyqE2OqYT3zZ43vdsvO80vfLlyiHrJ/p1lfY7EAVOI+pmnzNHRKkIwCuh2Qhc0vazTVly9Dlw2O4SAE1celZ0tfz4Kt81NIXaWplExdGa2f2c1cKNTtyhoy5qFXiS5s9J4CjGa6lEzRT3ZDH6IFoBrEOsHTUjFOpHYD8G2pcXqPkCfZw3obmXyMT+CYC58JC9o+nms2oRwJlIqdqwEyqj6O2ErMvj/VJWhdPFHMafmAs8I7y7SJd1TMVMUiyVM0VFpuGW98ZCr4jIW1Mq+Y+JYTQY4Ygf6kz/DC1v00NeumHCUJTqrnEL4Ag9h98qED1UlnHhSjzTHflQFQi9o/DPZ4vMhU= anatol@WIN-QLVHA9MV1CM
            EOT
        }
      + name                      = "terraform2"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd807ed79a4kkqfvd1mb"
              + name        = (known after apply)
              + size        = (known after apply)
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + placement_group_id = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_vpc_network.network-1 will be created
+ resource "yandex_vpc_network" "network-1" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "network1"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.subnet-1 will be created
+ resource "yandex_vpc_subnet" "subnet-1" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet1"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ external_ip_address_vm_1 = (known after apply)
+ external_ip_address_vm_2 = (known after apply)
+ internal_ip_address_vm_1 = (known after apply)
+ internal_ip_address_vm_2 = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://51.250.83.119:4141/lock?id=avloton%252Fterraform-cloud%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
